</details>
#### Terraform Apply 📖`success`
<details><summary>Show apply</summary>
```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mrandom_string.suffix: Refreshing state... [id=PDAiHiUU][0m
[0m[1mmodule.eks.module.kms.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...[0m[0m
[0m[1mmodule.eks.module.kms.data.aws_partition.current: Reading...[0m[0m
[0m[1mdata.aws_availability_zones.available: Reading...[0m[0m
[0m[1mdata.aws_region.current: Reading...[0m[0m
[0m[1mmodule.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.db.module.db_option_group.aws_db_option_group.this[0]: Refreshing state... [id=codecationdb-20231028110919390900000002][0m
[0m[1mmodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537][0m
[0m[1mmodule.alb_ingress_controller_role.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/codecation-eks-PDAiHiUU/cluster][0m
[0m[1mdata.aws_region.current: Read complete after 0s [id=eu-west-1][0m
[0m[1mmodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03d3fce8c088107a5][0m
[0m[1mmodule.alb_ingress_controller_role.data.aws_region.current: Read complete after 0s [id=eu-west-1][0m
[0m[1mmodule.db.module.db_instance.data.aws_partition.current: Reading...[0m[0m
[0m[1mdata.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.alb_ingress_controller_role.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.module.eks_managed_node_group["green"].data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_eks_cluster_auth.codecation_eks_module: Reading...[0m[0m
[0m[1mmodule.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mdata.aws_eks_cluster_auth.codecation_eks_module: Read complete after 0s [id=codecation-eks-PDAiHiUU][0m
[0m[1mmodule.alb.module.access_logs.data.aws_partition.current: Reading...[0m[0m
[0m[1mdata.aws_eks_cluster.codecation_eks_module: Reading...[0m[0m
[0m[1mmodule.alb_ingress_controller_role.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.alb_ingress_controller_role.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.alb.module.access_logs.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=codecationdb-20231028110919384500000001][0m
[0m[1mmodule.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=099211283664][0m
[0m[1mmodule.eks.module.eks_managed_node_group["green"].data.aws_caller_identity.current: Read complete after 0s [id=099211283664][0m
[0m[1mmodule.alb_ingress_controller_role.data.aws_caller_identity.current: Read complete after 0s [id=099211283664][0m
[0m[1maws_cloudwatch_log_group.codecation_eks_log_group: Refreshing state... [id=/aws/eks/PDAiHiUU/codeaction_eks_cluster/cluster][0m
[0m[1mmodule.eks.module.eks_managed_node_group["green"].data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=CodecationRDSMonitoringRole][0m
[0m[1mmodule.eks.module.eks_managed_node_group["green"].data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mdata.aws_iam_policy_document.load_balancer_controller: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.load_balancer_controller: Read complete after 0s [id=2683745981][0m
[0m[1mmodule.eks.data.aws_caller_identity.current: Read complete after 0s [id=099211283664][0m
[0m[1mmodule.eks.data.aws_iam_session_context.current: Reading...[0m[0m
[0m[1mmodule.eks.module.eks_managed_node_group["green"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks_managed_node_group["green"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296][0m
[0m[1mmodule.alb_ingress_controller_role.data.aws_iam_policy_document.load_balancer_controller[0]: Reading...[0m[0m
[0m[1mmodule.alb_ingress_controller_role.data.aws_iam_policy_document.load_balancer_controller[0]: Read complete after 0s [id=3014472196][0m
[0m[1maws_iam_policy.eks_elb_ingress_policy: Refreshing state... [id=arn:aws:iam::099211283664:policy/terraform-20231028110919394700000004][0m
[0m[1mmodule.eks.data.aws_iam_session_context.current: Read complete after 1s [id=arn:aws:sts::099211283664:assumed-role/admin/aws-go-sdk-1698492342080841820][0m
[0m[1mmodule.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067][0m
[0m[1mmodule.eks.module.eks_managed_node_group["green"].aws_iam_role.this[0]: Refreshing state... [id=green-eks-node-group-20231028110919392700000003][0m
[0m[1mdata.aws_availability_zones.available: Read complete after 1s [id=eu-west-1][0m
[0m[1mmodule.alb_ingress_controller_role.aws_iam_policy.load_balancer_controller[0]: Refreshing state... [id=arn:aws:iam::099211283664:policy/AmazonEKS_AWS_Load_Balancer_Controller-20231028110919555600000006][0m
[0m[1mmodule.eks.aws_iam_role.this[0]: Refreshing state... [id=codecation-eks-PDAiHiUU-cluster-20231028110919399500000005][0m
[0m[1mmodule.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=CodecationRDSMonitoringRole-20231028110919598700000007][0m
[0m[1mdata.aws_eks_cluster.codecation_eks_module: Read complete after 1s [id=codecation-eks-PDAiHiUU][0m
[0m[1mmodule.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=green-eks-node-group-20231028110919392700000003-20231028110919692700000009][0m
[0m[1mmodule.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=green-eks-node-group-20231028110919392700000003-20231028110919612000000008][0m
[0m[1mmodule.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=green-eks-node-group-20231028110919392700000003-2023102811091972830000000b][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=codecation-eks-PDAiHiUU-cluster-20231028110919399500000005-2023102811091973750000000c][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=codecation-eks-PDAiHiUU-cluster-20231028110919399500000005-2023102811091972750000000a][0m
[0m[1mmodule.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=483941571][0m
[0m[1mmodule.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=d8268744-b969-4813-a225-8f6f9bbadb2f][0m
[0m[1mmodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-010ca1b3d1773ae8d][0m
[0m[1mmodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-032b75d9f9b356fc6][0m
[0m[1mmodule.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0a71cb288d574e738][0m
[0m[1mmodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0c8a9528b134bcc51][0m
[0m[1maws_security_group.eks_sg_puplic: Refreshing state... [id=sg-0cae42819b4bfbbd8][0m
[0m[1maws_security_group.eks_node_sg: Refreshing state... [id=sg-0ebf12facd7c69e5e][0m
[0m[1mmodule.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-06c5c2f4c90939971][0m
[0m[1mmodule.alb.aws_security_group.default[0]: Refreshing state... [id=sg-0f028f112736ba7ee][0m
[0m[1mmodule.alb.aws_lb_target_group.default[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:099211283664:targetgroup/default/ee181ff839b590a1][0m
[0m[1mmodule.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-020d296a9252990a1][0m
[0m[1mmodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0bb41d19029ca7700][0m
[0m[1mmodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08b945106f3c48ea1][0m
[0m[1mmodule.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-09952749bf6010d43][0m
[0m[1mmodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ddfd9b428083297b][0m
[0m[1mmodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0dd4cbd165157b7f1][0m
[0m[1mmodule.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-002c0e2014f36b7b0][0m
[0m[1mmodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09ebd5d8c2d236a7f][0m
[0m[1mmodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0264bc1fab2b8c2b4][0m
[0m[1mmodule.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-0d44a8f3a2874b572][0m
[0m[1mmodule.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-068c554a9e7a195e3][0m
[0m[1mmodule.vpc.aws_subnet.intra[2]: Refreshing state... [id=subnet-07316aeb3bc904413][0m
[0m[1mmodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0260851e75ce8502f][0m
[0m[1mmodule.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/codecation-eks-PDAiHiUU][0m
[0m[1mmodule.alb.aws_security_group_rule.http_ingress[0]: Refreshing state... [id=sgrule-472126195][0m
[0m[1mmodule.alb.aws_security_group_rule.egress[0]: Refreshing state... [id=sgrule-2619103661][0m
[0m[1maws_security_group.eks_rds_sg: Refreshing state... [id=sg-065027239e5494514][0m
[0m[1mmodule.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::099211283664:policy/codecation-eks-PDAiHiUU-cluster-ClusterEncryption20231028110941321500000013][0m
[0m[1mmodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05f71318ec1cf3885][0m
[0m[1mmodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ae7a51c0a04234bd][0m
[0m[1mmodule.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0565ce98a36aa6813][0m
[0m[1mmodule.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-284784525][0m
[0m[1mmodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c7e14fc53b0954f5][0m
[0m[1mmodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00c52be40d936b901][0m
[0m[1mmodule.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-05b0fbf6cc2f48fe3][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-956403237][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2503589142][0m
[0m[1mmodule.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2581012573][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2999859038][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3350607797][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3597599893][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1758489833][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2710702975][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2148560957][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-828776185][0m
[0m[1mmodule.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-0765c604ad9c7d5c1][0m
[0m[1mmodule.vpc.aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-0ae0012151b6f27e9][0m
[0m[1mmodule.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-09eb7efade521b896][0m
[0m[1mmodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0264bc1fab2b8c2b41080289494][0m
[0m[1mmodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ddbf3ed80158443b][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=codecation-eks-PDAiHiUU-cluster-20231028110919399500000005-20231028110941478000000014][0m
[0m[1mmodule.alb.aws_lb.default[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:099211283664:loadbalancer/app/tf-lb-20231028110936783700000012/8fc152c12765dcdb][0m
[0m[1mmodule.db.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=codecationdb-20231028110934511400000011][0m
[0m[1mmodule.alb_ingress.data.aws_lb_target_group.default[0]: Reading...[0m[0m
[0m[1mmodule.eks.aws_eks_cluster.this[0]: Refreshing state... [id=codecation-eks-PDAiHiUU][0m
[0m[1mmodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-015161e0fa7d5f764][0m
[0m[1mmodule.eks.time_sleep.this[0]: Refreshing state... [id=2023-10-28T11:19:26Z][0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["coredns"]: Reading...[0m[0m
[0m[1mmodule.eks.data.tls_certificate.this[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...[0m[0m
[0m[1mmodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09ebd5d8c2d236a7f1080289494][0m
[0m[1mmodule.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-JOETXNCVYLQSH6N52YRL64TSFM][0m
[0m[1mmodule.alb.aws_lb_listener.http_redirect[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:099211283664:listener/app/tf-lb-20231028110936783700000012/8fc152c12765dcdb/168df560f67e538a][0m
[0m[1mmodule.eks.module.eks_managed_node_group["green"].aws_launch_template.this[0]: Refreshing state... [id=lt-0e139f8793780cc2a][0m
[0m[1mmodule.alb_ingress.data.aws_lb_target_group.default[0]: Read complete after 1s [id=arn:aws:elasticloadbalancing:eu-west-1:099211283664:targetgroup/default/ee181ff839b590a1][0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 1s [id=coredns][0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 1s [id=kube-proxy][0m
[0m[1mmodule.eks.module.eks_managed_node_group["green"].aws_eks_node_group.this[0]: Refreshing state... [id=codecation-eks-PDAiHiUU:green-20231028111928198300000019][0m
[0m[1mmodule.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 1s [id=vpc-cni][0m
[0m[1mmodule.eks.data.tls_certificate.this[0]: Read complete after 1s [id=eae3d1a78da36d265617d0e58ee6c9f6db23c834][0m
[0m[1mmodule.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::099211283664:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/71561C77DDB8594112DE713489BA71E1][0m
[0m[1mmodule.alb_ingress_controller_role.data.aws_iam_policy_document.this[0]: Reading...[0m[0m
[0m[1mmodule.alb_ingress_controller_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3258691053][0m
[0m[1mmodule.alb_ingress_controller_role.aws_iam_role.this[0]: Refreshing state... [id=CodeCationALBIngressController][0m
[0m[1mmodule.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=codecation-eks-PDAiHiUU:coredns][0m
[0m[1mmodule.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=codecation-eks-PDAiHiUU:kube-proxy][0m
[0m[1mmodule.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=codecation-eks-PDAiHiUU:vpc-cni][0m
[0m[1mmodule.alb_ingress_controller_role.aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=CodeCationALBIngressController-20231028111857449800000016][0m
[0m[1mmodule.alb_ingress_controller_role.aws_iam_role_policy_attachment.load_balancer_controller[0]: Refreshing state... [id=CodeCationALBIngressController-20231028111857378000000015][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # module.eks.module.eks_managed_node_group["green"].aws_eks_node_group.this[0][0m has changed
[0m  [33m~[0m[0m resource "aws_eks_node_group" "this" {
        id                     = "codecation-eks-PDAiHiUU:green-20231028111928198300000019"
      [32m+[0m[0m labels                 = {}
        tags                   = {
            "Name" = "green"
        }
        [90m# (15 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # helm_release.alb_ingress_controller[0m will be created
[0m  [32m+[0m[0m resource "helm_release" "alb_ingress_controller" {
      [32m+[0m[0m atomic                     = false
      [32m+[0m[0m chart                      = "aws-load-balancer-controller"
      [32m+[0m[0m cleanup_on_fail            = false
      [32m+[0m[0m create_namespace           = false
      [32m+[0m[0m dependency_update          = false
      [32m+[0m[0m disable_crd_hooks          = false
      [32m+[0m[0m disable_openapi_validation = false
      [32m+[0m[0m disable_webhooks           = false
      [32m+[0m[0m force_update               = false
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m lint                       = false
      [32m+[0m[0m manifest                   = (known after apply)
      [32m+[0m[0m max_history                = 0
      [32m+[0m[0m metadata                   = (known after apply)
      [32m+[0m[0m name                       = "alb-ingress-controller"
      [32m+[0m[0m namespace                  = "kube-system"
      [32m+[0m[0m pass_credentials           = false
      [32m+[0m[0m recreate_pods              = false
      [32m+[0m[0m render_subchart_notes      = true
      [32m+[0m[0m replace                    = false
      [32m+[0m[0m repository                 = "https://aws.github.io/eks-charts"
      [32m+[0m[0m reset_values               = false
      [32m+[0m[0m reuse_values               = false
      [32m+[0m[0m skip_crds                  = false
      [32m+[0m[0m status                     = "deployed"
      [32m+[0m[0m timeout                    = 300
      [32m+[0m[0m values                     = [
          [32m+[0m[0m <<-EOT
                "clusterName": "codecation-eks-PDAiHiUU"
                "region": "eu-west-1"
                "serviceAccount":
                  "annotations":
                    "eks.amazonaws.com/role-arn": "arn:aws:iam::099211283664:role/CodeCationALBIngressController"
                  "name": "aws-load-balancer-controller"
                "vpcId": "vpc-03d3fce8c088107a5"
            EOT,
        ]
      [32m+[0m[0m verify                     = false
      [32m+[0m[0m version                    = "1.6.2"
      [32m+[0m[0m wait                       = true
      [32m+[0m[0m wait_for_jobs              = false
    }

[1m  # kubernetes_service_account.service-account[0m will be created
[0m  [32m+[0m[0m resource "kubernetes_service_account" "service-account" {
      [32m+[0m[0m automount_service_account_token = true
      [32m+[0m[0m default_secret_name             = (known after apply)
      [32m+[0m[0m id                              = (known after apply)

      [32m+[0m[0m metadata {
          [32m+[0m[0m annotations      = {
              [32m+[0m[0m "eks.amazonaws.com/role-arn"               = "arn:aws:iam::099211283664:role/CodeCationALBIngressController"
              [32m+[0m[0m "eks.amazonaws.com/sts-regional-endpoints" = "true"
              [32m+[0m[0m "meta.helm.sh/release-name"                = "alb-ingress-controller"
              [32m+[0m[0m "meta.helm.sh/release-namespace"           = "kube-system"
            }
          [32m+[0m[0m generation       = (known after apply)
          [32m+[0m[0m labels           = {
              [32m+[0m[0m "app.kubernetes.io/component"  = "controller"
              [32m+[0m[0m "app.kubernetes.io/managed-by" = "Helm"
              [32m+[0m[0m "app.kubernetes.io/name"       = "aws-load-balancer-controller"
            }
          [32m+[0m[0m name             = "aws-load-balancer-controller"
          [32m+[0m[0m namespace        = "kube-system"
          [32m+[0m[0m resource_version = (known after apply)
          [32m+[0m[0m uid              = (known after apply)
        }
    }

[1m  # module.eks.kubernetes_config_map_v1_data.aws_auth[0][0m will be created
[0m  [32m+[0m[0m resource "kubernetes_config_map_v1_data" "aws_auth" {
      [32m+[0m[0m data          = {
          [32m+[0m[0m "mapAccounts" = jsonencode([])
          [32m+[0m[0m "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::099211283664:role/green-eks-node-group-20231028110919392700000003"
                  "username": "system:node:{{EC2PrivateDNSName}}"
            EOT
          [32m+[0m[0m "mapUsers"    = jsonencode([])
        }
      [32m+[0m[0m field_manager = "Terraform"
      [32m+[0m[0m force         = true
      [32m+[0m[0m id            = (known after apply)

      [32m+[0m[0m metadata {
          [32m+[0m[0m name      = "aws-auth"
          [32m+[0m[0m namespace = "kube-system"
        }
    }

[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m[0m[1mmodule.eks.kubernetes_config_map_v1_data.aws_auth[0]: Creating...[0m[0m
[0m[1mkubernetes_service_account.service-account: Creating...[0m[0m
[0m[1mmodule.eks.kubernetes_config_map_v1_data.aws_auth[0]: Creation complete after 1s [id=kube-system/aws-auth][0m
[0m[1mkubernetes_service_account.service-account: Creation complete after 2s [id=kube-system/aws-load-balancer-controller][0m
[0m[1mhelm_release.alb_ingress_controller: Creating...[0m[0m
[0m[1mhelm_release.alb_ingress_controller: Still creating... [10s elapsed][0m[0m
[0m[1mhelm_release.alb_ingress_controller: Creation complete after 17s [id=alb-ingress-controller][0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with module.eks.aws_eks_addon.this["coredns"],
[33m│[0m [0m  on .terraform/modules/eks/main.tf line 392, in resource "aws_eks_addon" "this":
[33m│[0m [0m 392:   resolve_conflicts        = [4mtry(each.value.resolve_conflicts, "OVERWRITE")[0m[0m
[33m│[0m [0m
[33m│[0m [0mThe "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
[33m│[0m [0mresource creation. Use "resolve_conflicts_on_create" and/or
[33m│[0m [0m"resolve_conflicts_on_update" instead
[33m│[0m [0m
[33m│[0m [0m(and 2 more similar warnings elsewhere)
[33m╵[0m[0m
Releasing state lock. This may take a few moments...
[0m[1m[32m
Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
[0m[0m[1m[32m
Outputs:

[0mcluster_arn = "arn:aws:eks:eu-west-1:099211283664:cluster/codecation-eks-PDAiHiUU"
cluster_endpoint = "https://71561C77DDB8594112DE713489BA71E1.sk1.eu-west-1.eks.amazonaws.com"
cluster_name = "codecation-eks-PDAiHiUU"
cluster_version = "1.28"
oidc_provider = "oidc.eks.eu-west-1.amazonaws.com/id/71561C77DDB8594112DE713489BA71E1"
oidc_provider_arn = "arn:aws:iam::099211283664:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/71561C77DDB8594112DE713489BA71E1"

```
</details>
*Pushed by: @anasgrt, Action: `pull_request`*